# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from the file given in the repo US_Baby_Names_right.csv

In [24]:
column_names = ['Id', 'Name', 'Year', 'Gender', 'State', 'Count']
pd.read_csv('US_Baby_Names_right.csv', header=None, names=column_names)

C:\Users\E1005250\AppData\Local\Temp\ipykernel_12024\72040601.py:2: DtypeWarning: Columns (1,3,6) have mixed types. Specify dtype option on import or set low_memory=False.
  pd.read_csv('US_Baby_Names_right.csv', header=None, names=column_names)

                Id     Name  Year  Gender  State  Count
NaN             Id     Name  Year  Gender  State  Count
11349.0      11350     Emma  2004       F     AK     62
11350.0      11351  Madison  2004       F     AK     48
11351.0      11352   Hannah  2004       F     AK     46
11352.0      11353    Grace  2004       F     AK     44
...            ...      ...   ...     ...    ...    ...
5647421.0  5647422     Seth  2014       M     WY      5
5647422.0  5647423  Spencer  2014       M     WY      5
5647423.0  5647424     Tyce  2014       M     WY      5
5647424.0  5647425   Victor  2014       M     WY      5
5647425.0  5647426   Waylon  2014       M     WY      5

[1016396 rows x 6 columns]

### Step 3. Assign it to a variable called baby_names.

In [25]:
baby_names = pd.read_csv('US_Baby_Names_right.csv', header=None, names=column_names)
baby_names

C:\Users\E1005250\AppData\Local\Temp\ipykernel_12024\3360806615.py:1: DtypeWarning: Columns (1,3,6) have mixed types. Specify dtype option on import or set low_memory=False.
  baby_names = pd.read_csv('US_Baby_Names_right.csv', header=None, names=column_names)

                Id     Name  Year  Gender  State  Count
NaN             Id     Name  Year  Gender  State  Count
11349.0      11350     Emma  2004       F     AK     62
11350.0      11351  Madison  2004       F     AK     48
11351.0      11352   Hannah  2004       F     AK     46
11352.0      11353    Grace  2004       F     AK     44
...            ...      ...   ...     ...    ...    ...
5647421.0  5647422     Seth  2014       M     WY      5
5647422.0  5647423  Spencer  2014       M     WY      5
5647423.0  5647424     Tyce  2014       M     WY      5
5647424.0  5647425   Victor  2014       M     WY      5
5647425.0  5647426   Waylon  2014       M     WY      5

[1016396 rows x 6 columns]

### Step 4. See the first 10 entries

In [26]:
baby_names.head(10)

            Id      Name  Year  Gender  State  Count
NaN         Id      Name  Year  Gender  State  Count
11349.0  11350      Emma  2004       F     AK     62
11350.0  11351   Madison  2004       F     AK     48
11351.0  11352    Hannah  2004       F     AK     46
11352.0  11353     Grace  2004       F     AK     44
11353.0  11354     Emily  2004       F     AK     41
11354.0  11355   Abigail  2004       F     AK     37
11355.0  11356    Olivia  2004       F     AK     33
11356.0  11357  Isabella  2004       F     AK     30
11357.0  11358    Alyssa  2004       F     AK     29

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [38]:
baby_names.drop('Id', axis=1)

              Name  Year  Gender  State  Count
NaN           Name  Year  Gender  State  Count
11349.0       Emma  2004       F     AK     62
11350.0    Madison  2004       F     AK     48
11351.0     Hannah  2004       F     AK     46
11352.0      Grace  2004       F     AK     44
...            ...   ...     ...    ...    ...
5647421.0     Seth  2014       M     WY      5
5647422.0  Spencer  2014       M     WY      5
5647423.0     Tyce  2014       M     WY      5
5647424.0   Victor  2014       M     WY      5
5647425.0   Waylon  2014       M     WY      5

[1016396 rows x 5 columns]

### Step 6. Is there more male or female names in the dataset?

In [27]:
gender_counts = baby_names['Gender'].value_counts()

if gender_counts['M'] > gender_counts['F']:
    print("There are more male names in the dataset.")
elif gender_counts['M'] < gender_counts['F']:
    print("There are more female names in the dataset.")
else:
    print("There are an equal number of male and female names in the dataset.")

There are more female names in the dataset.

### Step 7. Group the dataset by name and assign to names

### Step 8. How many different names exist in the dataset?

### Step 9. What is the name with most occurrences?

### Step 10. How many different names have the least occurrences?

### Step 11. What is the median name occurrence?

### Step 12. What is the standard deviation of names?

### Step 13. Get a summary with the mean, min, max, std and quartiles.